import './style.scss';
import { createPage } from './components/view/create-page';
import { startGame } from './components/start-game';

createPage();
startGame();

console.log(
  '  - Basic scope +70 \n',
  '    - вёрстка, дизайн, UI. Внешний вид приложения соответствует приложению-прототипу или является его улучшенной версией. Выполняются требования к оформлению приложения +10\n',
  '    - используются собственные оригинальные интересные разнообразные задания на нахождение css-селекторов. Количество заданий не меньше десяти +10\n',
  '    - выполнен блок 1 с примером вёрстки. Элементы, для которых необходимо написать css-селектор, выделены при помощи анимации +10\n',
  '    - выполнен блок 2 с окном для ввода кода пользователем. В окне для ввода кода можно напечатать css-селектор +10\n',
  '    - выполнен блок 3 с кодом вёрстки, в котором отображается код вёрстки +10 \n',
  '    - выполнен блок 4 со списком уровней игры. У пользователя есть возможность переходить к определённому уровню кликая по его номеру +10\n',
  '    - текущий уровень подсвечен. При перезагрузке приложение открывается на этом же уровне +10\n',
  '  - Advanced scope +50 \n',
  '    - подсветка html и css-кода в блоках 2 и 3 - окне для ввода кода пользователем и блоке с кодом вёрстки. Для подсветки кода могут использоваться js-библиотеки +10 \n',
  '    - введённые пользователем селекторы можно отправить на проверку как кликом по кнопке Enter в окне для ввода кода, так и нажатием клавиши Enter на клавиатуре. Отправленные на проверку селекторы проверяются на соответствие требованиям задания +10\n',
  '    - если пользователь ввёл правильный css-селектор, отвечающий всем выделенным элементам, отображается соответствующая анимация, и автоматически открывается следующий уровень игры, или выводится уведомление о победе, если уровень последний. Если пользователь ответил неправильно, отображается соответствующая анимация. +10\n',
  '    - в приложении есть кнопка Help для тех случаев, когда пользователь не сумеет угадать нужный селектор. Клик по кнопке Help выводит нужный селектор в окне для ввода кода. Селектор выводится с эффектом печати текста (плавное появление текста по буквам) +10\n',
  '    - возле каждого уровня игры отображается, выполнен он, или нет, или уровень выполнен с использованием подсказки. Есть кнопка, позволяющая сбросить прогресс и начать прохождение игры заново +10\n',
  '  120 / 150',
);
